{
    "siteTable": {
        "topic": [
            {
                "section": [
                    {
                        "title": "Home"
                    ,
                        "paragraph": "The <b>Rokni.net</b> is an 'experimental' site. I try new technologies here and then move it to Rokni.com. Anything related to html, css, javascript, design, patterns that is interesting and needs to be tried out will be tested. So it should be considered as a <b>Hard Hat Area</b> within browsers."
                    ,
                        "first": "true"
                    }
                ]
            },
            {
                "section": [
                    {
                        "title": "Updates"
                    ,
                        "subtitle": "<form name='range' class='range'><input type='range' id='range' min='0' max='3' step='1' value='3'><ul class='input-range'><li class='tabs-1'>03/08</li><li class='tabs-2'>10/10</li><li class='tabs-3'>06/11</li><li class='tabs-4 light-color'>10/13</li></ul></form>"
                    ,
                        "paragraph": "<span id='tabs-1' class='hide'><time datetime='2008-03-01'>March 2008</time> - For long time, I wanted to overhaul the site. Now, I am planning to code it with PHP and MySQL, revamp its underlying CSS and JavaScript, including DOM scripting and asynchronous call, as needed, and finally some mash-ups;although, this may take a while.<a href='http://www.rokni.com/032208/' class='more' title='Just A Sneak Pick'>take a look</a></span><span id='tabs-2' class='hide'><time datetime='2010-10-01'>October 2010</time> - The site is changing to use HTML5, more CSS3 and probably AJAX for functionality. Its progress depends on finding a balance between maintenance and layout. Also, I have an eye on tablets and smartphones for this iteration.</span><span id='tabs-3' class='hide'><time datetime='2011-06-01'>June 2011</time> - As more capable browsers are introduced, the site shall continue its progress for implementing HTML5, CSS3, AJAX and PHP functionalities while degrade nicely for older browsers.</span><span id='tabs-4'><time datetime='2013-10-01'>October 2013</time> - The site is getting ready for a major overhaul of serverside templating using Node.js and Mustache, later will come implemntation of client side templateing.</span>",
                        "range": "true"
                    }
                ]
            },
            {
                "section": [
                    {
                        "title": "Web Performance"
                    ,                   
                        "paragraph": "An interesting topic that I am working as of now is, Web Performance. I am testing, analyzing and optimizing this site and the Rokni.com with Google <a href='https://developers.google.com/speed/'>PageSpeed Tools</a>, <a href='https://developers.google.com/closure/compiler/'>Closure Compiler</a> Service UI, <a href='http://developer.yahoo.com/yslow/'>YSlow</a> and some other interesting online tools to make the site faster.<br>Basically, Rokni.net is competing against Rokni.com which uses Google's PageSpeed Service to load faster. Current score: <span id='chart-container' data-highcharts-chart='0'></span>"
                    }
                ]
            },
            {
                "section": [
                    {
                        "title": "Responsive Web Design"
                    ,
                        "paragraph": "Rokni.com has already created with Responsive web design (<abbr title='esponsive web design'>RWD</abbr>) in mind although it has a limited reach. Rokni.net is inherited the stylesheet, however its css needs to be overhauled/cleaned. Once Web Performance reaches within a satisfactory results and all updates and functionalities are done, I'll make this site works on mobile (including smart phones and tablets) devices with <abbr title='Responsive web design'>RWD</abbr> experiences."
                    }
                ]
            },
            {
                "section": [
                    {
                        "title": "Delicious"
                    ,
                        "paragraph": "<span id='delicious'></span>"
                    }
                ]
            }
        ]
    }
}
